#### Terraform Dev Plan 🧪
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.main.aws_acm_certificate.api_cert will be updated in-place
  ~ resource "aws_acm_certificate" "api_cert" {
        id                        = "arn:aws:acm:us-east-2:864981738327:certificate/3e30a3e3-2878-4f74-b785-7244c36f24ef"
        tags                      = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.main.aws_acm_certificate.cloudfront_cert will be updated in-place
  ~ resource "aws_acm_certificate" "cloudfront_cert" {
        id                        = "arn:aws:acm:us-east-1:864981738327:certificate/a1b7e3f7-838b-42c5-b936-8646a7c15997"
        tags                      = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.main.aws_api_gateway_domain_name.api_gateway_domains["api"] will be updated in-place
  ~ resource "aws_api_gateway_domain_name" "api_gateway_domains" {
        id                       = "api-dev.zipcase.org"
        tags                     = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.main.aws_api_gateway_domain_name.api_gateway_domains["app-api"] will be updated in-place
  ~ resource "aws_api_gateway_domain_name" "api_gateway_domains" {
        id                       = "app-api-dev.zipcase.org"
        tags                     = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.main.aws_cognito_user_pool_client.zipcase_app_client will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "zipcase_app_client" {
        id                                            = "33seh8akmc7r88ptb1h7c6dpjs"
        name                                          = "zipcase-app-client"
        # (17 unchanged attributes hidden)
    }

  # module.main.aws_ssm_parameter.alert_email will be updated in-place
  ~ resource "aws_ssm_parameter" "alert_email" {
      ~ has_value_wo     = true -> (known after apply)
        id               = "/zipcase/alert-email"
      + insecure_value   = (known after apply)
        name             = "/zipcase/alert-email"
        tags             = {}
      + value            = (sensitive value)
      - value_wo_version = 1 -> null
      ~ version          = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.main.aws_ssm_parameter.zipcase_app_client_id will be updated in-place
  ~ resource "aws_ssm_parameter" "zipcase_app_client_id" {
      ~ has_value_wo     = true -> (known after apply)
        id               = "/zipcase/cognito/app_client_id"
      + insecure_value   = (known after apply)
        name             = "/zipcase/cognito/app_client_id"
        tags             = {}
      + value            = (sensitive value)
      - value_wo_version = 1 -> null
      ~ version          = 2 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.main.aws_ssm_parameter.zipcase_user_pool_id will be updated in-place
  ~ resource "aws_ssm_parameter" "zipcase_user_pool_id" {
      ~ has_value_wo     = true -> (known after apply)
        id               = "/zipcase/cognito/user_pool_id"
      + insecure_value   = (known after apply)
        name             = "/zipcase/cognito/user_pool_id"
        tags             = {}
      + value            = (sensitive value)
      - value_wo_version = 1 -> null
      ~ version          = 2 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
